Revit 2027 API
Units.DigitGroupingAmount Property
 The number of digits in each group when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DigitGroupingAmount DigitGroupingAmount { get; set; }
Public Property DigitGroupingAmount As DigitGroupingAmount
	Get
	Set
public:
property DigitGroupingAmount DigitGroupingAmount {
	DigitGroupingAmount get ();
	void set (DigitGroupingAmount value);
}
member DigitGroupingAmount : DigitGroupingAmount with get, set
Property Value
DigitGroupingAmount
 The number of digits in each group. The default is Three.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This setting only has an effect when the UseDigitGrouping property is set to true in the FormatOptions object for the unit type being formatted.
See Also
Reference
Units Class
Autodesk.Revit.DB Namespace